Repository: cran/mgcv
Catalog: po/*.po
Languages: it

source: magic requires smoothing parameter starting values if L supplied
it: magic richiede lo smoothing dei valori iniziali dei parametri se L è passato

source: magic, the gcv/ubre optimizer, failed to converge after 400 iterations.
it: magic, l'ottimizzatore gcv/ubre, non è riuscito a convergere dopo 400 iterazioni.

source: Failed to initialize memory for matrix.
it: Non è possibile inizializzare la memoria per la matrice.

source: An out of bound write to matrix has occurred!
it: Si è verificata una scrittura fuori limite per la matrice!

source: INTEGRITY PROBLEM in the extant matrix list.
it: PROBLEMA DI INTEGRITA' nell'elenco della matrice esistente.

source: You are trying to check matrix integrity without defining RANGECHECK.
it: Si sta cercando di verificare l'integrità della matrice senza definire RANGECHECK.

source: Target matrix too small in mcopy
it: Matrice obiettivo troppo piccola in mcopy

source: Incompatible matrices in matmult.
it: Matrici incompatibili in matmult.

source: Attempt to invert() non-square matrix
it: Tentato invert() di una matrice non quadrata

source: Singular Matrix passed to invert()
it: Matrice singolare passata a invert()

source: ERROR in addconQT.
it: ERRORE in addconQT.

source: QPCLS - Rank deficiency in model
it: QPCLS - Carenza di rango nel modello

source: You must have 2m>d for a thin plate spline.
it: Bisogna avere 2m>d per una spline piatta e sottile.

source: A term has fewer unique covariate combinations than specified maximum degrees of freedom
it: Un termine ha meno combinazioni di covariate uniche rispetto ai gradi massimi di libertà specificati
