Repository: cran/mgcv
Catalog: po/R-*.po
Languages: it

source: Discrete Theta search not available with performance iteration
it: La ricerca del Theta discreto non è disponibile con iterazione delle prestazioni

source: y must be univariate unless binomial
it: 'y' dev'essere univariato a meno che binomiale

source: Length of start should equal %d and correspond to initial coefs.
it: La lunghezza di 'start' dovrebbe essere uguale a %d e corrispondere ai coefficienti iniziali.

source: iterative weights or data non-finite in gam.fit - regularization may help. See ?gam.control.
it: pesi iterativi o dati non finiti in gam.fit - la regolarizzazione potrebbe aiutare. Si veda ?gam.control.

source: Step size truncated: out of bounds.
it: Dimensione del passo troncata: fuori dai limiti.

source: `object' is not of class "gam"
it: `object' non è della classe "gam"

source: unrecognised na.action
it: na.action non riconosciuta

source: na.action not character or function
it: na.action non è ne un character ne una funzione

source: Smoothness uncertainty corrected covariance not available
it: La covarianza corretta dall'incertezza del livellamento non è disponibile

source: Unknown type, reset to terms.
it: Tipo sconosciuto, si reimpostano i termini.

source: predict.gam can only be used to predict from gam objects
it: predict.gam possono essere utilizzati per predire da oggetti gam

source: newdata is a model.frame: it should contain all required variables
it: newdata è un model.frame: dovrebbe contenere tutte le variabili richieste

source: no NAs allowed in response data for this model
it: nessun NA ammesso nei dati risposta per questo modello

source: not all required variables have been supplied in newdata!
it: non tutte le variabili richieste sono state passate in newdata!

source: non-existent terms requested - ignoring
it: termini richiesti non esistenti - ignorato

source: non-existent exclude terms requested - ignoring
it: termini di esclusione richiesti non esistenti - ignorato

source: requires an object of class gam
it: richiede un oggetto di classe gam

source: nothing to do for this model
it: niente da fare per questo modello

source: Pearson residuals not available for this family - returning deviance residuals
it: Residui di Pearson non disponibili per questa famiglia - si restituiscono i residui della devianza

source: lambda and h should have the same length!
it: 'lambda' e 'h' dovrebbero avere la medesima lunghezza!

source: recov works with fitted gam objects only
it: 'recov' funziona solo con oggetti adattati gam

source: m can't be in re
it: m non può essere in re

source: p-values for any terms that can be penalized to zero will be unreliable: refit model to fix this.
it: i p-value di tutti i termini che possono essere penalizzati a zero saranno inaffidabili: ri-adattare il modello per risolvere questo problema.

source: The following arguments to anova.glm(..) are invalid and dropped:
it: I seguenti argomenti di anova.glm(..) non sono validi e sono rilasciati:

source: un-supported test
it: test non supportato

source: test argument ignored
it: argomento test ignorato

source: anova.gam called with non gam object
it: anova.gam chiamato senza oggetto gam

source: not a gam object
it: non è un oggetto gam

source: argument is not a gam object
it: l'argomento non è un oggetto gam

source: S.scale vector doesn't match S list - please report to maintainer
it: Il vettore S.scale non corrisponde all'elenco S - per piacere, segnalatelo al maintainer del pacchetto

source: Supplied matrix not symmetric
it: Matrice passata non simmetrica

source: singular values not returned in order
it: valori singolari non restituiti in ordine

source: Something wrong - matrix probably not +ve semi definite
it: Qualcosa non va - la matrice probabilmente non è +ve semi-definita

source: method not recognised.
it: metodo non riconosciuto.

source: S[[%d]] matrix is not +ve definite.
it: La matrice S[[%d]] non è definita +ve.

source: dimensions of supplied w wrong.
it: le dimensioni di w sono errate.

source: w different length from y!
it: con lunghezza differente da y!

source: mu dimensions wrong
it: dimensioni di mu errate

source: something wrong with inputs to LAPACK routine
it: c'è qualcosa di sbagliato nei valori di ingresso nella routine LAPACK

source: not positive definite
it: non definito positivo

source: don't be silly
it: non essere stupido

source: update not positive definite
it: aggiornamento non positivo definito

source: internal error in vcorr, please report to simon.wood@r-project.org
it: errore interno in vcorr, per piacere, segnalatelo a simon.wood@r-project.org

source: a has wrong number of rows
it: a ha un numero errato di righe

source: mvn requires 2 or more dimensional data
it: mvn richiede 2 o più dati dimensionali

source: mvn does not yet handle offsets
it: mvn non gestisce ancora gli offset

source: mvn dimension error
it: errore dimensione mvn

source: non-integer binomial denominator: quantiles incorrect
it: denominatore binomiale non intero: quantili non corretti

source: object is not a glm or gam
it: l'oggetto non è un glm o gam

source: names of z and pc must match
it: i nomi di z e pc devono corrispondere

source: Partial residuals do not have a natural x-axis location for linear functional terms
it: I residui parziali non hanno una posizione naturale sull'asse x (ascisse) per termini funzionali lineari

source: no automatic plotting for smooths of more than two variables
it: nessun plot automatico per gli smooth con più di due variabili

source: no automatic plotting for smooths of more than four variables
it: nessun plot automatico per gli smooth con più di quattro variabili

source: argument pers is deprecated, please use scheme instead
it: l'argomento 'pers' è deprecato, per piacere, si utilizzi 'scheme' in alternativa

source: residuals argument to plot.gam is wrong length: ignored
it: l'argomento 'residuals' per plot.gam ha lunghezza errata: ignorato

source: No variance estimates available
it: Nessuna stima di varianza disponibile

source: No terms to plot - nothing for plot.gam() to do.
it: Nessun termin per il plot - niente da fare per plot.gam().

source: data vectors are of different lengths
it: i vettori dei dati hanno differenti lunghezze

source: Model does not seem to have enough terms to do anything useful
it: Il modello non sembra avere abbastanza termini per fare qualcosa di utile

source: view variables must be one of %s
it: le variabili di visualizzazione devono essere una di %s

source: Don't know what to do with parametric terms that are not simple numeric or factor variables
it: Non si sa cosa fare con i termini parametrici che non sono semplici numerici o variabili fattore

source: View variables must contain more than one value. view = c(%s,%s).
it: Le variabili di visualizzazione devono contenere più di un valore. view = c(%s,%s).

source: type must be "link" or "response"
it: il tipo dev'essere "link" o "response"

source: Something wrong with zlim
it: Qualcosa è andato storto con zlim

source: color scheme not recognised
it: schema colore non riconosciuto

source: At least three knots required in call to mono.con.
it: Almeno tre knot richiesti nella chiamata a mono.con.

source: lower bound >= upper bound in call to mono.con()
it: banda inferiore >= banda superiore nella chiamata a mono.con()

source: x is null
it: x è nullo

source: order too low
it: ordine troppo piccolo

source: too few knots
it: pochi knot

source: x out of range
it: x fuori intervallo

source: something wrong with argument d.
it: c'è qualcosa di sbagliato con l'argomento 'd'.

source: one or more supplied k too small - reset to default
it: uno o più dei k passati è troppo piccolo - si reimposta ai valori predefiniti

source: dimension of fx is wrong
it: la dimensione di fx è errata

source: xt argument is faulty.
it: argomento 'xt' diffettoso.

source: bs wrong length and ignored.
it: bs ha lunghezza errata e viene ignorato.

source: m wrong length and ignored.
it: m ha lunghezza errata e viene ignorato.

source: Repeated variables as arguments of a smooth are not permitted
it: Le variabili ripetute come argomenti di un livellamento non sono consentite

source: only first element of `id' used
it: si utilizza solo il primo elemento di 'id'

source: ord is wrong. reset to NULL.
it: ord è errato. Si utilizza NULL.

source: ord contains out of range orders (which will be ignored)
it: 'ord' contiene ordini fuori intervallo (che saranno ignorati)

source: by=. not allowed
it: by=. non ammesso

source: s(.) not supported.
it: s(.) non supportato.

source: s(.) not yet supported.
it: s(.) non ancora supportato.

source: argument k of s() should be integer and has been rounded
it: l'argomento k di s() dovrebbe essere intero ed è stato arrotondato

source: attempt to use unsuitable marginal smooth class
it: tentato utilizzo di una classe uniforme marginale non adatta

source: reparameterization unstable for margin: not done
it: ri-parametrizzazione non stabile per il margine: non eseguito

source: basis not usable with reduced te
it: base non utilizzabile con un te ridotto

source: fx length wrong from t2 term: ignored
it: lunghezza fx errata per il termine t2: ignorata

source: length of sp incorrect in t2: ignored
it: la lunghezza di 'sp' è incorretta in 't2': ignorata

source: d can not be negative in call to null.space.dimension().
it: d non può essere negativo nella chiamata a null.space.dimension().

source: arguments of smooth not same dimension
it: gli argomenti del livellamento non hanno la medesima dimensione

source: components of knots relating to a single smooth must be of same length
it: i componenti dei knot relativi ad un singolo livellamento devono avere la stessa lunghezza

source: more knots than data in a tp term: knots ignored.
it: più knot che dati nel termine tp: knot ignorati.

source: basis dimension, k, increased to minimum possible
it: dimensione base, k, incrementata al minimo possibile

source: no data to predict at
it: nessun dato a cui predire

source: Basis only handles 1D smooths
it: La base gestisce solo livellamenti 1D

source: number of supplied knots != k for a cr smooth
it: numero di knot forniti !=k per un cr smooth

source: F is missing from cr smooth - refit model with current mgcv
it: F assente dal livellamento cr - riadattate il modello con l'attuale mgcv

source: more knots than unique data values is not allowed
it: non è ammesso avere più knot che valori univoci

source: number of supplied knots != k for a cc smooth
it: numero di knot forniti !=k per un cc smooth

source: basis dimension too small for b-spline order
it: dimensione base troppo piccola per b-spline order

source: knot range does not include data
it: l'intervallo del nodo (knot) non include i dati

source: there should be
it: dovrebbero essere

source: supplied knots
it: know passati

source: knots supplied
it: knot passati

source: penalty order too high for basis dimension
it: ordine penalità troppo alto per la dimensione base

source: there is *no* information about some basis coefficients
it: non ci sono informazioni circa i coefficienti base

source: basis dimension is larger than number of unique covariates
it: la dimensione base è maggiore del numero di covariate uniche

source: multiple penalties of the same order is silly
it: penalità multiple per il medesimo ordine non ha senso

source: fs smooths can only have one factor argument
it: i livellamenti fs possono avere solo un argomento con un fattore

source: "fs" smooth cannot use a multiply penalized basis (wrong basis in xt)
it: il livellamento "fs" non può utilizzare una base penalizzata multipla (base errate in xt)

source: no factor supplied to fs smooth
it: nessun fattore passato per il livellamento fs

source: "fs" terms can not be fixed here
it: i termini in "fs" non possono essere fissati qui

source: fs smooth not suitable for discretisation with more than one metric predictor
it: livellamento fs non adatto alla discretizzazione con più di un predittore metrico

source: the adaptive smooth class is limited to 1 or 2 covariates.
it: la classe di livellamento adattivo è limitata a 1 o 2 covariate.

source: penalty basis too large for smoothing basis
it: base di penalità troppo larga per basi di livellamento

source: penalty basis too small
it: base di penalità troppo piccola

source: random effects don't work with ids.
it: gli effetti casuali non funzionano con ids.

source: Please put term with most levels last in 're' to avoid spoiling supplied penalties
it: Per piacere, indicate il termine con la maggior parte dei livelli ultimi in 'ri' per evitare di rovinare le penalità passata

source: supplied S matrices are wrong diminsion
it: la matrice S passata ha dimensioni errate

source: argument of mrf should be a factor variable
it: l'argomento di mrf dovrebbe essere una variabile fattore

source: MRF basis dimension set too high
it: Dimensione base MRF impostata troppo alta

source: no spatial information provided!
it: nessuna informazione spaziale passata!

source: Something wrong with auto- penalty construction
it: Qualcosa non va nella costruzione della penalità automatica

source: supplied penalty not square!
it: la penalizzazione passata non è quadrata!

source: supplied penalty wrong dimension!
it: la penalizzazione passata a errate dimensioni!

source: penalty column names don't match supplied area names!
it: i nomi della colonna penalità non corrispondono con i nomi area passati!

source: Can only deal with a sphere
it: Si può gestire unicamente una sfera

source: more knots than data in an sos term: knots ignored.
it: più knot che dati nel termine sos: knot ignorati.

source: more knots than data in a ds term: knots ignored.
it: più knot che dati nel termine ds: knot ignorati.

source: A term has fewer unique covariate combinations than specified maximum degrees of freedom
it: Un termine ha meno combinazioni di covariate uniche rispetto ai gradi massimi di libertà specificati

source: s value reduced
it: valore s riminuito

source: s value increased
it: valore s incrementato

source: No suitable s (i.e. m[2]) try increasing m[1]
it: Nessun s adeguato (es. m[2]), si provi ad incrementare m[1]

source: s value modified to give continuous function
it: valore 's' modificato per dare una funzione continua

source: basis dimension reset to minimum possible
it: la dimensione base è ripristinata al minimo possibile

source: incorrect arguments to GP smoother
it: argomenti errati per lo smoother GP

source: more knots than data in an ms term: knots ignored.
it: più knot che dati nel termine ms: knot ignorati.

source: smooth objects should not have a qrc attribute.
it: gli oggetti di livellamento non dovrebbero avere un attributo qrc.

source: unimplemented sparse constraint type requested
it: richiesto tipo di vincolo sparso non implementato

source: Can't find by variable
it: Non è possibile cercare per variabile

source: factor `by' variables can not be used with matrix arguments.
it: le variabili fattore `by 'non possono essere utilizzate con argomenti della matrice.

source: `by' variable must be same dimension as smooth arguments
it: la variabile 'by' dev'essere la medesima dimensione degli argomenti di livellamento

source: Number of prediction and fit constraints must match
it: Il numero di vincoli di previsione e adattamento deve corrispondere

source: x and y must be same length
it: x e y devono essere della medesima lunghezza

source: variable names don't match boundary names
it: i nomi delle variabili non corrispondono ai nomi dei limiti

source: x and y not same length
it: x e y non della stessa lunghezza

source: bnd must be a list.
it: bnd dev'essere una lista.

source: lengths of k and bnd are not compatible.
it: le lunghezze di 'k' e 'bnd' non sono compatibili.

source: attempt to select non existent basis function
it: tentata selezione di un'inesistente funzione base

source: coefficient vector wrong length
it: vettore coefficienti con lunghezza errata

source: knots must be specified for soap
it: i knot devono essere specificati per soap

source: need at least one interior knot
it: richiesto almento un nodo (knot) interno

source: bnd must be a list of boundary loops
it: bnd dev'essere un elenco di cicli limite

source: faulty bnd
it: bnd difettoso

source: k and bnd lengths are inconsistent
it: le lunghezze di k e bnd sono inconsistenti

source: no free coefs in sf smooth
it: nessun coefficiente libero nel livellamento fs

source: only deals with 2D case
it: tratta solo con casi 2D

source: not enough unique values to find k nearest
it: non ci sono abbastanza valori unici per trovare il k più vicino

source: cubic spline only deals with 1D data
it: la spline cubica si occupa solo di dati 1D

source: object not fully initialized
it: oggetto non inizializzato completamente
