Repository: cran/mgcv
Catalog: po/R-*.po
Languages: it

source: bam can not discretize with this nesting structure
it: bam non può discretizzare con questa struttura nidificata

source: 'family' argument seems not to be a valid family object
it: l'argomento 'family' non sembra essere un oggetto family valido

source: This family should not have a matrix response
it: Questa famiglia non dovrebbe avere una risposta matrice

source: cannot find valid starting values: please specify some
it: non riesco a trovare valori iniziali validi: si prega di specificarne alcuni

source: Deviance = %s Iterations - %d
it: Devianza = %s Iterazioni - %d

source: Non-finite deviance
it: Devianza non finita

source: non-finite coefficients at iteration %d
it: coefficienti non finiti nell'iterazione %d

source: algorithm did not converge
it: l'algoritmo non converge

source: fitted rates numerically 0 occurred
it: sono occorsi tassi adattati numericamente 0

source: Too many cluster nodes to use all efficiently
it: Troppi nodi nel cluster per un utilizzo efficiente

source: iterms reset to terms
it: iterms ripristinato a terms

source: family not recognized
it: famiglia non riconosciuta

source: un-supported smoothness selection method
it: metodo di selezione livellamento non supportato

source: discretization only available with fREML
it: discretizzazione disponibile solo con fREML

source: discrete method does not use parallel cluster - use nthreads instead
it: il metodo discreto non utilizza il cluster 'parallel' - utilizza nthreads in alternativa

source: openMP not available: single threaded computation only
it: openMP non è disponibile: disponibile solo la computazione a thread singolo

source: min.sp not supported with fast REML computation, and ignored.
it: 'min.sp' non è supportato con la computazione fast REML, sarà ignorato.

source: no smooths, ignoring `discrete=TRUE'
it: nessun livellamento, si ignora `discrete=TRUE'

source: Not enough (non-NA) data to do anything meaningful
it: Dati insufficienti (non NA) per fare qualcosa di significativo

source: AR.start must be logical
it: AR.start dev'essere logico

source: chunk.size < number of coefficients. Reset to %d
it: chunk.size < numero di coefficienti. Reimpostata a %d

source: Model has more coefficients than data
it: Il modello ha più coefficienti che dati

source: length of sp must be number of free smoothing parameters in original model
it: la lunghezza di 'sp' dev'essere un numero di parametri di livellamento liberi nel modello originale

source: general families not supported by bam
it: famiglie generiche non supportate da bam

source: AR1 parameter rho unused with generalized model
it: Il parametro AR1 rho è inutilizzato con i modelli generalizzati

source: samfrac too small - ignored
it: samfrac è troppo piccolo - ignorato

source: Model can not be updated
it: Il modello non può essere aggiornato

source: link not available for coxph family; available link is "identity"
it: link non disponibile per la famiglia coxph; il link disponibile è "identity"

source: something wrong with stratified prediction
it: c'è qualcosa di sbagliato con la previsione stratificata

source: NA times supplied for cox.ph prediction
it: Tempi con NA passati per la previsione di cox.ph

source: not an extended family
it: non è una famiglia estesa

source: erroneous call to estimate.theta - no free parameters
it: chiamata errata a estimate.theta - nessun parametro libero

source: step failure in theta estimation
it: fallimento del passo nella stima theta

source: link not available for ordered categorical family; available links are "identity"
it: link non disponibile per la famiglia categorica ordinata; i link disponibili sono "identity"

source: Must supply theta or R to ocat
it: Bisogna passare theta o R a ocat

source: Response should be integer class labels
it: La risposta dovrebbero essere etichette di classe intera

source: values out of range
it: valori fuori intervallo

source: link not available for negative binomial family; available links are "identity", "log" and "sqrt"
it: link non disponibile per la famiglia binomiale negativa; i link disponibili sono "identity", "log" e "sqrt"

source: negative values not allowed for the negative binomial family
it: valori negativi non ammessi per la famiglia binomiale negativa

source: link "%s" not available for Tweedie family.
it: link "%s" non disponibile per la famiglia Tweedie.

source: Tweedie p must be in interval (a,b)
it: La p di Tweedie dev'essere nell'intervallo (a,b)

source: link not available for beta regression; available links are "logit", "probit", "cloglog" and "cauchit"
it: link non disponibile per la regressione beta; i link disponibili sono "logit", "probit", "cloglog" e "cauchit"

source: link not available for scaled t distribution; available links are "identity", "log", and "inverse"
it: link non disponibile per la distribuzione t di scala; i link disponibili sono "identity", "log" e "inverse"

source: Supplied df below min.df. min.df reset
it: Il df passato è inferiore a min.df. Si reimposta min.df

source: NA values not allowed for the scaled t family
it: Valori NA non ammessi per la famiglia t in scala

source: link not available for zero inflated; available link for `lambda' is only "loga"
it: link non disponibile per inflazione zero; il link disponibile per 'lambda' è unicamente "loga"

source: negative values not allowed for the zero inflated Poisson family
it: i valori negativi non sono ammessi per la famiglia Poisson ad inflazione zero

source: Non-integer response variables are not allowed with ziP
it: Le variabili di risposta non intere non sono ammesse con ziP

source: Using ziP for binary data makes no sense
it: L'utilizzo di ziP per dati binari non ha senso

source: Possible divergence detected in fast.REML.fit
it: Possibile divergenza rilevata in fast.REML.fit

source: fast REML optimizer reached iteration limit
it: l'ottimizzatore fast REML ha raggiunto il limite di iterazioni

source: unsupported order of differentiation requested of gam.fit3
it: richiesto ordine di differenziazione di gam.fit3 non supportato

source: illegal `family' argument
it: argomento `family' illegale

source: Invalid linear predictor values in empty model
it: Predittore lineare non valido nel modello vuoto

source: Invalid fitted means in empty model
it: Medie adattate non valide nel modello vuoto

source: Length of start should equal %d and correspond to initial coefs for %s
it: La lunghezza di 'start' dovrebbe essere uguale a %d e corrispondere ai coefficienti iniziali per %s

source: Can't find valid starting values: please specify some
it: Non è possibile trovare valori iniziali validi: per piacere, indicateli

source: NAs in V(mu)
it: NA in V(mu)

source: 0s in V(mu)
it: 0 in V(mu)

source: NAs in d(mu)/d(eta)
it: NA in d(mu)/d(eta)

source: No observations informative at iteration %d
it: Nessuna osservazione informativa all'iterazione %d

source: Not enough informative observations.
it: Non ci sono abbastanza osservazioni informative.

source: Non-finite coefficients at iteration %d
it: Coefficienti non finiti nell'iterazione %d

source: no valid set of coefficients has been found:please supply starting values
it: non è stato trovato alcun insieme valido di coefficienti; per piacere, passate dei valori di partenza

source: Step size truncated due to divergence
it: Dimensione del passo troncata a causa della divergenza

source: inner loop 1; can't correct step size
it: ciclo interno 1; non è possibile correggere la dimensione del passo

source: Step size truncated: out of bounds
it: Dimensione del passo troncata: fuori dai limiti

source: inner loop 2; can't correct step size
it: ciclo interno 2; non è possibile correggere la dimensione del passo

source: penalized deviance = %s
it: devianza penalizzata = %s

source: inner loop 3; can't correct step size
it: ciclo interno 3; non è possibile correggere la dimensione del passo

source: Step halved: new penalized deviance = %g
it: Passo dimezzato: nuova devianza penalizzata =%g

source: Non finite derivatives. Try decreasing fit tolerance! See `epsilon' in `gam.contol'
it: Derivate non finite. Prova a ridurre la tolleranza di adattamento! Vedi `epsilon' in `game.control'

source: Non-finite derivatives. Try decreasing fit tolerance! See `epsilon' in `gam.contol'
it: Derivate non finite. Provate a ridurre la tolleranza di adattamento! Si veda `epsilon 'in` game.control'

source: Algorithm did not converge
it: L'algoritmo non converge

source: Algorithm stopped at boundary value
it: L'algoritmo si è fermato al valore limite

source: deriv should be 1 or 2
it: deriv dovrebbe essere 1 o 2

source: L must be a matrix.
it: L dev'essere una matrice.

source: L must have at least as many rows as columns.
it: L deve avere almeno tante righe quanto le colonne.

source: L has inconsistent dimensions.
it: L ha dimensioni inconsistenti.

source: Fitting terminated with step failure - check results carefully
it: Adattamento terminato con errore di passo: controllare attentamente i risultati

source: Iteration limit reached without full convergence - check carefully
it: Limite di iterazione raggiunto senza piena convergenza - controllate attentamente

source: link not implemented for extended families
it: link non implementati per le famiglie estese

source: fam not a family object
it: fam non è un oggetto famiglia

source: unrecognized (vector?) link
it: link (vettore?) non riconosciuto

source: link not recognised
it: link non riconosciuto

source: variance function not recognized for quasi
it: funzione della varianza non riconosciuta per quasi

source: family not recognised
it: famiglia non riconosciuta

source: 'theta' must be specified
it: 'theta' dev'essere specificato

source: %s link not available for negative binomial family; available links are "identity", "log" and "sqrt"
it: %s link non disponibile per la famiglia binomiale negativa; i link disponibili sono "identity", "log" e "sqrt"

source: H has wrong dimension
it: H ha una dimensione errata

source: only scalar `rho' and `theta' allowed.
it: sono ammessi solo gli scalari `rho 'e` theta'.

source: 1<a<b<2 (strict) required
it: 1<a<b<2 (strict) richiesto

source: only scalar `p' and `phi' allowed.
it: sono ammessi solo gli scalari `p' e `phi'.

source: p must be in [1,2]
it: p dev'essere in [1,2]

source: y must be strictly positive for a Gamma density
it: 'y' dev'essere strettamente positivo per una densità Gamma

source: y must be an integer multiple of phi for Tweedie(p=1)
it: 'y' dev'essere un intero multiplo di 'phi' per Tweedie(p=1)

source: all.derivs only available in rho, theta parameterization
it: all.derivs è disponibile solo nella parametrizzazione rho, theta

source: Tweedie density may be unreliable - series not fully converged
it: La densità di Tweedie potrebbe essere inaffidabile - serie non completamente convergenti

source: Only 1<p<=2 supported
it: Solo 1<p<=2 supportato

source: p must be in (1,2)
it: p dev'essere in (1,2)

source: mean, mu, must be non negative
it: mean e mu devono essere non negativi

source: scale parameter must be positive
it: il parametro di scala dev'essere positivo

source: emtpy models not available
it: modelli vuoti non disponibili

source: Length of start should equal
it: La lunghezza di 'start' dovrebbe essere uguale

source: and correspond to initial coefs for
it: e corrispondono ai coefficienti iniziali per

source: no good data in iteration
it: nessun dato valido nell'iterazione

source: Non-finite coefficients at iteration
it: Coefficienti non finiti all'iterazione

source: not enough finite derivatives
it: non ci sono abbastanza derivate finite

source: non finite values in Hessian
it: valori non finiti in Hessian

source: indefinite penalized likelihood in gam.fit5
it: probabilità penalizzata indefinita in gam.fit5

source: iteration limit reached: max abs grad = %g
it: limite di iterazione raggiunto: max abs grad =%g

source: dist not recognised
it: dist non riconosciuto

source: gaulss requires 2 links specified as character strings
it: gaulss richiede 2 link specificati come stringhe di caratteri

source: link not available for mu parameter of gaulss
it: link non disponibile per il parametro mu di gaulss

source: link not available for precision parameter of gaulss
it: link non disponibile per il parametro precisione di gaulss

source: number of categories must be at least 2
it: il numero di categorie dev'essere almeno 2

source: number of linear predictors doesn't match
it: il numero di predittori lineari non corrisponde

source: ziplss requires 2 links specified as character strings
it: ziplss richieste 2 link specificati come stringhe di caratteri

source: link not available for
it: link non disponibile per

source: parameter of ziplss
it: parametro di ziplss

source: Non-integer response variables are not allowed with ziplss
it: Le variabili di risposta non intere non sono ammesse con ziplss

source: Using ziplss for binary data makes no sense
it: L'utilizzo di ziplss per dati binari non ha senso

source: gevlss requires 3 links specified as character strings
it: gevlss richiede 3 link specificati come stringhe di caratteri

source: link not available for mu parameter of twlss
it: link non disponibile per il parametro mu di twlss

source: gammals requires 2 links specified as character strings
it: gammals richiede 2 link specificati come stringhe di caratteri

source: link not available for mu parameter of gammals
it: link non disponibile per il parametro mu di gammals

source: An object of length %d does not match the required parameter size
it: Un oggetto di lunghezza %d non corrisponde alla dimensione richiesta per il parametro

source: NA's in pdTens factor
it: NA nel fattore pdTens

source: Cannot extract the matrix from an uninitialized object
it: Non è possibile estrarre la matrice da un oggetto non inizializzato

source: NA's in pdTens matrix
it: NA nella matrice pdTens

source: Cannot extract the matrix from an uninitialized pdMat object
it: Non è possibile estrarre la matrice da un oggetto pdMat non inizializzato

source: Cannot extract the matrix with uninitialized dimensions
it: Non è possibile estrarre la matrice con dimensioni non inizializzate

source: An object of length
it: Un oggetto di lunghezza

source: does not match the required parameter size
it: non corrisponde alla dimensione del parametro richiesta

source: Must give names when initializing pdIdnot from parameter.
it: Bisogna indicare dei nomi quando si inizializza pdldnot da un parametro.

source: without a formula
it: senza una formula

source: Cannot extract the dimensions
it: Non è possibile estrarre le dimensioni

source: Cannot extract the inverse from an uninitialized object
it: Non è possibile estrarre l'inversa di un oggetto non inizializzato

source: Can not convert this smooth class to a random effect
it: Non è possibile convertire questa classe di livellamento in random effect

source: No data supplied to gamm.setup
it: Nessun dato passato a gamm.setup

source: gamm can not handle linked smoothing parameters (probably from use of `id' or adaptive smooths)
it: gamm non può gestire i parametri di adattamento collegati (probabilmente per l'uso di 'id' o livellamenti adattivi)

source: only one level of smooth nesting is supported by gamm
it: gamm supporta solo un livello di nidificazione regolare (smooth nesting)

source: object does not appear to be of class lme
it: l'oggetto non sembra essere della classe lme

source: inner groupings not nested in outer!!
it: raggruppamenti interni non nidificati in esterno!!

source: iteration %d
it: iterazione %d

source: gamm not converged, try increasing niterPQL
it: gamm non converge, prova ad aumentare niterPQL

source: family are not designed for use with gamm!
it: famiglia non progettata per l'utilizzo con gamm!

source: gamm is not designed to use extended families
it: gamm non è progettato per l'utilizzo di famiglie estese

source: random argument must be a *named* list.
it: l'argomento 'random' dev'essere una lista *nominata*.

source: all elements of random list must be named
it: tutti gli elementi di una lista casuale devono essere nominati

source: gamm() can only handle random effects defined as named lists
it: gamm() può gestire solo effetti casuali definiti come liste nominate

source: gamm models must have at least 1 smooth with unknown smoothing parameter or at least one other random effect
it: i modelli gamm devono avere almeno 1 livellamento con parametro di smoothing sconosciuto o almeno un altro effetto casuale

source: weights must be like glm weights for generalized case
it: i pesi devono essere come pesi glm per il caso generalizzato

source: Nested smooths must be fully random
it: I livellamenti nidificati devono essere completamente casuali

source: size must be in [1,120]
it: size dev'essere in [1,120]

source: modal weight <=0 in integration step!!
it: peso modale <=0 nel passo integrazione!!

source: Requires a gam or bam prefit object
it: Richiede un oggetto pre-adattato gam o bam

source: bam fits only supported with discrete==TRUE
it: gli adattamenti bam sono supportati solo con discrete==TRUE

source: integration not available with this family - insufficient derivatives
it: integrazione non disponibile con questa famiglia - derivate insufficienti

source: something wrong with A index vector
it: c'è qualcosa di sbagliato nel vettore indice A

source: sorry link not yet handled
it: ci dispiace, link non ancora gestito

source: weights ignored
it: pesi ignorati

source: family not implemented yet
it: famiglia non ancora implementata

source: jagam requires a file for the JAGS model specification
it: jagam richiede un file per le specifiche del modello JAGS

source: smoothing parameter prior choise not recognised, reset to gamma
it: la scelta del parametro a priori di livellamento non è riconosciuta, si ripristina a gamma

source: coefficient simulation data is missing
it: mancano i dati di simulazione del coefficiente

source: burnin too large, reset
it: burnin è troppo largo, si annulla

source: residuals argument not supported
it: argomento 'residuals' non supportato

source: unconditional argument not meaningful here
it: argomento 'unconditional' non significativo qui

source: by.resids argument not supported
it: argomento by.resids non supportato

source: all.terms argument not supported
it: argomento all.terms non supportato

source: silly tolerance supplied
it: indicata 'tolerance' debole

source: argument k must be positive.
it: l'argomento k dev'essere positivo.

source: A not square
it: A non quadrata

source: Can not have more eigenvalues than nrow(A)
it: Non è possibile avere più autovalori (eigenvalue) che nrow(A)

source: initial parameters not feasible
it: parametri iniziali non fattibili

source: initial point very close to some inequality constraints
it: punto iniziale molto vicino ad alcuni vincoli di disuguaglianza

source: initial parameters very close to inequality constraints
it: parametri iniziali molto vicini ai vincoli di disuguaglianza

source: M$S and M$off have different lengths
it: M$S e M$off hanno lunghezze differenti

source: M$sp has different length to M$S and M$off
it: M$sp ha una lunghezza differente da M$S e M$off

source: M$S[%d] is too large given M$off[%d]
it: M$S[%d] è troppo largo dato M$off[%d]

source: Penalized model matrix must have no more columns than rows
it: La matrice del modello penalizzato non deve avere più colonne delle righe

source: Model matrix not full column rank
it: Matrice del modello non ha rango di colonna completo

source: can't handle [[ in formula
it: non è possibile gestire [[ nella formula

source: single linear predictor indices are ignored
it: gli indici dei predittori lineari singoli sono ignorati

source: linear predictor labels out of range
it: etichette del predittore lineare fuori portata

source: model has repeated 1-d smooths of same variable.
it: il modello ha ripetuto 1-d smooth della stessa variabile.

source: `id' linked smooths must have same number of arguments
it: I livellamenti (smooths) collegati a 'id' devono avere lo stesso numero di argomenti

source: `rank' has wrong length in `paraPen'
it: `rank' ha una lunghezza errata in `paraPen'

source: a parametric penalty has wrong dimension
it: una penalizzazione parametrica ha dimensione errata

source: L has wrong dimension in `paraPen'
it: L ha una dimensione errata in `paraPen'

source: `sp' dimension wrong in `paraPen'
it: dimensione 'sp' errata in 'paraPen'

source: `sp' too short
it: `sp' troppo corto

source: No data supplied to gam.setup
it: Nessun dato passato a gam.setup

source: paraPen not supported for multi-formula models
it: 'paraPen' non supportato per modelli multi-formula

source: absorb.cons must be TRUE for multi-formula models
it: assorb.cons dev'essere TRUE per i modelli multi-formula

source: length(drop.intercept) should be equal to number of model formulas
it: length(drop.intercept) dovrebbe essere uguale al numero di formule del modello

source: dropping unidentifiable parametric terms from model
it: si rilasciano i termini parametrici non identificabili dal modello

source: First argument is no sort of formula!
it: Il primo argomento non è in alcun modo una formula!

source: You've got no model....
it: Non si è ottenuto alcun modello...

source: Later terms sharing an `id' can not have more smoothing parameters than the first such term
it: I termini successivi che condividono un `id 'non possono avere più parametri di livellamento rispetto al primo di questi termini

source: Supplied smoothing parameter vector is too short - ignored.
it: Il vettore dei parametri di livellamento passato è troppo corto - ignorato.

source: NA's in supplied smoothing parameter vector - ignoring.
it: NA passati nel vettore dei parametri di livellamento - ignorato.

source: incorrect number of smoothing parameters supplied for a smooth term
it: numero errato di parametri di livellamento forniti per un termine di smooth

source: length of min.sp is wrong.
it: la lunghezza di min.sp è errata.

source: NA's in min.sp.
it: NA in min.sp.

source: elements of min.sp must be non negative.
it: gli elementi di min.sp devono essere non negativi.

source: unknown outer optimization method.
it: metodo dell'ottimizzatore esterno sconosciuto.

source: Please provide a single value for theta or use nb to estimate it
it: Per piacere, indicate un valore singolo per theta o utilizzate nb per stimarlo

source: nlm.fd only available for GCV/UBRE
it: nlm.fd disponibile solo per GCV/UBRE

source: unknown optimizer
it: ottimizzatore sconosciuto

source: unknown smoothness selection criterion
it: criterio di selezione adattamento sconosciuto

source: Reset optimizer to outer/newton
it: Si ripristina l'ottimizzatore su outer/newton

source: in.out incorrect: see documentation
it: in.out errato: consultare la documentazione

source: incorrect number of linear predictors for family
it: numero errato di predittori lineari per la famiglia

source: edge.correct must be logical or a positive number
it: edge.correct dev'essere logico o un numero positivo

source: nthreads must be a positive integer
it: nthreads dev'essere un intero positivo

source: IRLS regularizing parameter must be a non-negative number.
it: Il parametro di regolarizzazione IRLS dev'essere un numero non negativo.

source: value of epsilon must be > 0
it: il valore di epsilon dev'essere > 0

source: maximum number of iterations must be > 0
it: il numero massimo d iterazioni dev'essere > 0

source: silly value supplied for rank.tol: reset to square root of machine precision.
it: indicato un valore debole per 'rank.tol': si ripristina alla radice quadrata della precisione macchina.

source: Model seems to contain no terms
it: Il modello sembra non contenere termini
